appCastEdu/app/controllers/categories_controller.rb

INSERT INTO "categories" ("tittle", "descrition", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tittle", "Cultura"], ["descrition", "Voltada aos Grupo de Música\r\n"], ["created_at", "2016-05-05 01:09:46.085862"], ["updated_at", "2016-05-05 01:09:46.085862"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save