appCastEdu/app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
SELECT  1 AS one FROM "users" WHERE "users"."email" = '' LIMIT 1
---
  def makeLogin
    user = User.find_by_email(params[:email])

    if !user.blank?