appCastEdu/app/controllers/password_reset_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."password_reset_key" = ? LIMIT 1  [["password_reset_key", "VFlZSg"]]
---
  def edit
    user = User.find_by_password_reset_key!(params[:key])

SELECT  "users".* FROM "users" WHERE "users"."password_reset_key" = ? LIMIT 1  [["password_reset_key", "VFlZSg"]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$YZMS4IG3ZHw7q0u1PZ83SuRdNV8CJaCh972itlukCCIWq.QoirJYq"], ["updated_at", "2016-04-20 21:09:22.550715"], ["id", 1]]
---
  def update
    user = User.find_by_password_reset_key!(params[:key])
    if user.password_reset_sent_at < 3.hours.ago
      puts "Chave expirada"
    elsif user.update_attributes(params[:user])