appCastEdu/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
SELECT "categories".* FROM "categories"
---
  def index
    @rooms = Room.all
    @categories = Category.all

INSERT INTO "rooms" ("tittle", "descrition", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tittle", "Ola"], ["descrition", "Decrt"], ["created_at", "2016-05-05 01:45:47.554421"], ["updated_at", "2016-05-05 01:45:47.554421"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_room
      @room = Room.find(params[:id])