appCastEdu/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?)  [["name", "Saimon"], ["email", "saimon@devdactic.com"], ["created_at", "2016-04-10 04:48:25.738180"], ["updated_at", "2016-04-10 04:48:25.738180"], ["token", "ZZTEyik4Gi4hSAptFHXyuTG5"]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
    def create
      if (User.create(user_params).valid?)
          User.create(user_params)
          puts "if"
        render json: @users
      elsif
          User.find_by(email: user_params.email)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "joao10101@gmail.com"]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = 'joao@gmail.com' LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "apdwrZVx56NU7MNZMDCHhney"]]
INSERT INTO "users" ("name", "email", "idRedeSocial", "password_digest", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def login
      user = User.find_by_email(params[:email])
      if !user.blank?
        if user && user.authenticate(params[:password])
          session[:user_token] = user.token
          render json: User.find_by(token: session[:user_token])
        end
      else
        user = User.create(user_params)

INSERT INTO "users" ("name", "email", "idRedeSocial", "password_digest", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?)
---
        def createtwitter
          puts "Ola"
          if (User.create(user_params).valid?)

SELECT  "users".* FROM "users" WHERE "users"."idRedeSocial" = ? LIMIT 1  [["idRedeSocial", "3045459928"]]
---
        def logintwitter

          puts "Console"
          user = User.find_by_idRedeSocial(params[:idRedeSocial])

SELECT "users".* FROM "users"
---
    def show
      @users = User.all