appCastEdu/app/controllers/users_controller.rb

    def new
      @usera = User.all
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1